import re
from typing import Optional

from pyrogram import Message

from constants.constants import MESSAGES


class Common:
    @staticmethod
    def prepare_query(message: Message) -> Optional[str]:
        args = message.text.split()[1:]
        if args:
            return " ".join(args)

    @staticmethod
    def send_not_found_message(message: Message = None):
        message.reply_text(MESSAGES.NOT_FOUND)

    @staticmethod
    def pronoun_replace(text):
        replaces = {
            "я": "ты",
            "Я": "Ты",
            "мы": "вы",
            "Мы": "Вы",
            "меня": "тебя",
            "Меня": "Тебя",
            "нас": "вас",
            "Нас": "Вас",
            "мне": "тебе",
            "Мне": "Тебе",
            "нам": "вам",
            "Нам": "Вам",
            "мной": "тобой",
            "Мной": "Тобой",
            "мой": "твой",
            "Мой": "Твой",
            "моя": "твоя",
            "Моя": "Твоя",
            "мое": "твое",
            "Мое": "Твое",
            "моё": "твоё",
            "Моё": "Твоё",
            "мои": "твои",
            "Мои": "Твои",
            "моего": "твоего",
            "Моего": "Твоего",
            "моей": "твоей",
            "Моей": "Твоей",
            "моих": "твоих",
            "Моих": "Твоих",
            "моему": "твоему",
            "Моему": "Твоему",
            "мою": "твою",
            "Мою": "Твою",
            "моим": "твоим",
            "Моим": "Твоим",
            "моими": "твоими",
            "Моими": "Твоими",
            "моём": "твоём",
            "Моём": "Твоём",
            "моем": "твоем",
            "Моем": "Твоем",
            "наш": "ваш",
            "Наш": "Ваш",
            "наша": "ваша",
            "Наша": "Ваша",
            "наше": "ваше",
            "Наше": "Ваше",
            "наши": "ваши",
            "Наши": "Ваши",
            "ты": "я",
            "Ты": "Я",
            "вы": "мы",
            "Вы": "Мы",
            "тебя": "меня",
            "Тебя": "Меня",
            "вас": "нас",
            "Вас": "Нас",
            "тебе": "мне",
            "Тебе": "Мне",
            "вам": "нам",
            "Вам": "Нам",
            "тобой": "мной",
            "Тобой": "Мной",
            "твой": "мой",
            "Твой": "Мой",
            "твоя": "моя",
            "Твоя": "Моя",
            "твое": "мое",
            "Твое": "Мое",
            "твоё": "моё",
            "Твоё": "Моё",
            "твои": "мои",
            "Твои": "Мои",
            "твоего": "моего",
            "Твоего": "Моего",
            "твоей": "моей",
            "Твоей": "Моей",
            "твоих": "моих",
            "Твоих": "Моих",
            "твоему": "моему",
            "Твоему": "Моему",
            "твою": "мою",
            "Твою": "Мою",
            "твоим": "моим",
            "Твоим": "Моим",
            "твоими": "моими",
            "Твоими": "Моими",
            "твоём": "моём",
            "Твоём": "Моём",
            "твоем": "моем",
            "Твоем": "Моем",
            "ваш": "наш",
            "Ваш": "Наш",
            "ваша": "наша",
            "Ваша": "Наша",
            "ваше": "наше",
            "Ваше": "Наше",
            "ваши": "наши",
            "Ваши": "Наши",
        }
        regstr = ""
        for r in replaces.keys():
            regstr = regstr + "|" + "\\b" + r + "\\b"
        regstr = regstr[1:]
        text_replaced = re.sub(
            regstr, lambda m: replaces.get(m.group(), m.group()), text
        )
        return text_replaced
